---
kind: property
id: P:Autodesk.Revit.DB.NumberSystem.ReferenceOffset
source: html/d17911dc-f601-b069-5e0a-dce4d683280e.htm
---
# Autodesk.Revit.DB.NumberSystem.ReferenceOffset Property

The offset to the reference curve.

## Syntax (C#)
```csharp
public double ReferenceOffset { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: The given value for referenceOffset must be no more than 30000 feet in absolute value.